Lab_01/latency_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $> Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/ Licensed to The Apache Software Foundation, http://www.apache.org/ Benchmarking 127.0.0.1 (be patient).....done Server Software: Werkzeug/3.1.8 Server Hostname: 127.0.0.1 Server Port: 5000 Document Path: / Document Length: 27 bytes Concurrency Level: 10 Time taken for tests: 1.430 seconds Complete requests: 100 Failed requests: 0 Total transferred: 20000 bytes HTML transferred: 2700 bytes Requests per second: 69.94 [#/sec] (mean) Time per request: 142.985 [ms] (mean) Time per request: 14.298 [ms] (mean, across all concurrent requests) Transfer rate: 13.66 [Kbytes/sec] received Connection Times (ms) min mean[+/-sd] median max Connect: 0 0 0.4 0 2 Processing: 14 118 94.1 85 489 Waiting: 2 106 94.1 73 477 Total: 15 118 94.1 87 489 Percentage of the requests served within a certain time (ms) 50% 87 66% 125 75% 159 80% 167 90% 269 95% 318 98% 376 99% 489 100% 489 (longest request)